Tekla Open API Reference for Tekla Structures 2025
AnalysisResult.LoadCaseInfo Property
 The load case info (optional, max length 128).
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public string LoadCaseInfo { get; set; }
Public Property LoadCaseInfo As String
	Get
	Set
Property Value
Type: String
See Also
Reference
AnalysisResult Class
Tekla.Structures.Analysis Namespace